[
    {
        "case_id": 1,
        "title": "Wirksamkeit von Annahme und Widerruf bei Vertragsschluss",
        "description": "Am Montagmorgen, dem 5.12.2022, ﬁndet Weinhändler Vogeler (V) eine ganze Reihe von Briefen in seinem Geschäftsbriefkasten. V nimmt die Briefe mit in sein Büro, wo er täglich seine Post erledigt. Zuerst öffnet V ein Schreiben seines Kunden Adam (A), dem er vor wenigen Tagen zwei Kisten erlesenen Rotweins zu einem Preis i. H. v. 200 € angeboten hat. Erfreut liest V, dass A das Angebot annimmt. Seine Freude währt aber nur kurz. Denn das nächste Schreiben, das V liest, enthält einen Widerruf der Annahme durch A. A hat nämlich das Annahmeschreiben am vergangenen Samstag zur Post gegeben und seinen Widerruf am Sonntag persönlich in den Briefkasten des V geworfen. Daher hat V am Montagmorgen beide Schreiben des A vorgefunden. V ist unsicher, ob er dem A die beiden Kisten zu dem Preis i. H. v. 200 € verkauft hat. Kann V von A die Zahlung von 200 € verlangen?",
        "solution": "V kann von A gem. § 433 Abs. 2 BGB die Zahlung von 200 € verlangen, wenn zwischen V als Verkäufer und A als Käufer ein Vertrag über den Verkauf der beiden Kisten Rotwein zu einem Preis i. H. v. 200 € zustande gekommen ist. Ein Kaufvertrag setzt voraus, dass sich die Parteien durch die Abgabe von übereinstimmenden Willenserklärungen, Angebot und Annahme, geeinigt haben. Die Willenserklärungen müssen auf den Abschluss eines Vertrags mit dem in § 433 BGB umschriebenen Inhalt gerichtet sein. I. Angebot von Seiten des V, § 145 BGB Davon, dass V ein Angebot zum Verkauf von zwei Kisten Rotwein abgegeben hat, kann aufgrund der Angaben im Sachverhalt ausgegangen werden. Insbesondere ist auch davon auszugehen, dass das Angebot die erforderliche Bestimmtheit aufweist, neben den Vertragsparteien also auch Kaufgegenstand und Kaufpreis angibt. II. 1. Annahme von Seiten des A, vgl. § 147 BGB Willenserklärung von Seiten des A A hat eine Erklärung verfasst, in der er seine uneingeschränkte Zustimmung zu dem von V abgegebenen Angebot zum Ausdruck bringt. Eine Annahmeerklärung liegt also vor. 2. Wirksamwerden der Willenserklärung, § 130 Abs. 1 Satz 1 BGB Eine empfangsbedürftige Willenserklärung, die unter Abwesenden abgegeben wird, wird gem. § 130 Abs. 1 Satz 1 BGB wirksam, wenn sie zugeht. a) Abgabe Willenserklärungen unter Abwesenden sind dann abgegeben, wenn der Erklärende sie in der Weise in den Verkehr gebracht hat, dass unter Zugrundelegung normaler Umstände mit Zugang gerechnet werden kann. Hier hat A das Annahmeschreiben am Samstag, dem 3.12., zur Post gegeben, sodass davon auszugehen war, dass es unter normalen Umständen bei V auch ankommt. b) Zugang Zugegangen ist die Erklärung dann, wenn sie so in den Bereich des Empfängers gelangt ist, dass dieser unter normalen Verhältnissen die Möglichkeit hat, von ihrem Inhalt Kenntnis zu nehmen. Hier ist die Annahmeerklärung am 5.12. im Geschäftsbriefkasten des V gelandet und damit in seinen Machtbereich gelangt. Die Möglichkeit der Kenntnisnahme hat V unter normalen Umständen aber erst zu dem Zeitpunkt, zu dem der Briefkasten üblicherweise geleert wird. Zu diesem Zeitpunkt ist die Annahmeerklärung dem V zugegangen. In diesem Fall bedeutet dies, dass die Annahmeerklärung des A dem V am Montagmorgen zugegangen ist. c) Kein Wirksamwerden der Annahmeerklärung gem. § 130 Abs. 1 Satz 2 BGB Nach § 130 Abs. 1 Satz 2 BGB wird eine Willenserklärung nicht wirksam, wenn vorher oder gleichzeitig ein Widerruf zugeht. Hier hat A – am Sonntag, dem 4.12. – einen Widerruf in den Briefkasten eingeworfen und damit in den Machtbereich des V verbracht. Auch die Möglichkeit der Kenntnisnahme von dem Widerruf hat V unter normalen Umständen am Montagmorgen. Annahmeerklärung und Widerrufserklärung sind also gleichzeitig zugegangen. Daher ist die Annahme des A nicht wirksam geworden; ein Kaufvertrag zwischen V und A ist nicht zustande gekommen. III. Ergebnis V kann von A nicht die Bezahlung von 200 € aus § 433 Abs. 2 BGB verlangen.",
        "difficulty_level": "einfach"
    },
    {
        "case_id": 8,
        "title": "Kaufvertrag mit Minderjährigen – Wirksamkeit, Zahlung und Forderungsabtretung",
        "description": "Der 15-jährige Anton (A) ist ein großer Fußballfan und bewundert seit langer Zeit die SportdressSammlung seines Nachbarn Norbert (N), der sämtliche Trikots der deutschen Nationalmannschaft gleich in mehrfacher Ausführung besitzt. Um auch vor seinen Fußballfreunden Eindruck zu schinden, beschließt A, dem N ein handsigniertes Trikot von Florian Wirtz abzukaufen. Sein Vater (V), selbst begeisterter Hobbykicker, stimmt diesem Plan zu. A und N einigen sich am Montag über den Kauf des Trikots zum Preis von 100 € . Da N das Trikot nur gegen Barzahlung herausgeben möchte und A nicht so viel Geld bei sich hat, vereinbaren beide den Austausch von Trikot und Geld für das folgende Wochenende. Als A am nächsten Tag jedoch mit schlechten Noten in zwei Klausuren nach Hause kommt, beschließt V, seinen Sohn dadurch zu bestrafen, dass er den Kaufpreis erst nach Ende des Schuljahres bezahlt und das Trikot dann übergibt. A ist damit nicht einverstanden, plündert seine Ersparnisse, gibt N am Freitag zwei 50 € -Scheine und erhält dafür das Trikot. N, der als Rentner über kein hohes Einkommen verfügt, aber dringend einen neuen Rasenmäher braucht, trat am Mittwoch unterdessen seine Forderung gegen 100 € an Untermieter Ulrich (U) ab. Am Samstagnachmittag spielt A stolz in seinem neuen Trikot Fußball, wobei er an einem Zaun hängen bleibt und das Trikot zerreißt. Nachdem V über die Geschehnisse informiert wird, verlangt er von N ein neues Trikot, weil dieser nicht an einen Minderjährigen hätte leisten dürfen. U könne seine Forderung auch vergessen, weil A jedenfalls dem N bereits die 100 € bezahlt habe. Hat U einen Anspruch auf Zahlung der 100 € gegen A?",
        "solution": "U könnte gegen A einen Anspruch auf Zahlung des Kaufpreises i. H. v. 100 € aus §§ 433 Abs. 2, 398 BGB haben. I. Anspruch entstanden A und U haben keinen Kaufvertrag über das Trikot miteinander geschlossen. U könnte aber durch eine Abtretung gem. §§ 398 ff. BGB einen Anspruch aus § 433 Abs. 2 BGB von N erworben haben. Dann müsste die Abtretung von N an U wirksam erfolgt sein. 1. Abtretungsvertrag U und N müssten sich wirksam über den Übergang der Kaufpreisforderung geeinigt haben, §§ 398, 145, 147 BGB. Das ist am Mittwoch geschehen. Wirksamkeitshindernisse sind nicht ersichtlich. 2. Kein Ausschluss der Abtretung Ein Ausschluss gem. §§ 399, 400 BGB kommt nicht in Betracht. 3. Bestehen der Forderung N müsste zur Abtretung berechtigt gewesen sein. Das setzt voraus, dass die abgetretene Kaufpreisforderung des N gegen A entstanden und nicht vor der Abtretung an U wieder erloschen ist. Inhaltlich haben sich A und N über den Kauf des von Florian Wirtz handsignierten Trikots zum Preis von 100 € gem. §§ 433, 145, 147 BGB geeinigt. Diese Einigung dürfte nicht wegen der Minderjährigkeit des A unwirksam sein. Gemäß §§ 2, 106 BGB ist A beschränkt geschäftsfähig und bedarf zu einer wirksamen Willenserklärung gem. §§ 107, 1626, 1629 Abs. 1 Satz 1 BGB der Einwilligung der Eltern als seiner gesetzlichen Vertreter. Problematisch könnte sein, dass der Vater V allein dem Kauf des Trikots zugestimmt hat, während gem. § 1629 Abs. 1 Satz 2 BGB die Eltern ihr Kind gemeinschaftlich zu vertreten haben. Bei lebensnaher Betrachtung kann jedoch davon ausgegangen werden, dass der Vater bzgl. des Hobbies Fußball, das er mit seinem Sohn teilt, mit der (nötigenfalls stillschweigenden) Zustimmung der Mutter gehandelt hat und seine Einwilligung daher genügte. Ein wirksamer Kaufvertrag zwischen A und N liegt somit vor. N trat die aus dem Kaufvertrag entstandene Kaufpreisforderung bereits am Mittwoch an U und damit vor dem Freitag ab, an dem A die 100 € an N zahlte. Somit kommt auch kein Erlöschen der Forderung vor der Abtretung in Betracht. 4. Zwischenergebnis U hat von N gem. § 398 BGB einen Kaufpreisanspruch i. H. v. 100 € aus § 433 Abs. 2 BGB gegen A wirksam durch Abtretung erworben. II. Anspruch nicht erloschen Der Anspruch könnte nach der Abtretung an U gem. § 362 Abs. 1 BGB durch Erfüllung erloschen sein, indem A dem N am Freitag die 100 € bezahlte. Das setzt voraus, dass A mit dieser Zahlung die geschuldete Leistung an den richtigen Gläubiger erbracht hat. 1. Bewirken der geschuldeten Leistung Aus dem mit N geschlossenen Kaufvertrag über das Trikot (siehe oben) war A aus § 433 Abs. 2 BGB dazu verp ﬂ ichtet, dem N den Kaufpreis i. H. v. 100 € zu zahlen. Das könnte er durch die Übergabe und Übereignung der 100 € an N gem. § 929 Satz 1 BGB getan haben. a) Übergabe der zwei 50 € -Scheine A hat dem N die zwei 50 € -Scheine übergeben und ihm damit gem. § 854 Abs. 1 BGB die tatsächliche Sachherrschaft über diese Banknoten übertragen. Dabei handelt es sich um einen Realakt, sodass die §§ 104 ff. BGB nicht anwendbar sind und es auf die Minderjährigkeit des A nicht ankommt. b) Einigung über den Eigentumsübergang A und N müssten sich gem. §§ 929 Satz 1, 145, 147 BGB über den Eigentumsübergang an den zwei 50 € -Scheinen geeinigt haben. Inhaltlich liegt eine solche Einigung vor. Wegen der Minderjährigkeit des A (§§ 2, 106 BGB) könnte sie aber unwirksam sein. aa) Fehlende Einwilligung des V Die Einigung i. S. d. § 929 Satz 1 BGB könnte wegen der fehlenden Einwilligung des V unwirksam sein. V hatte beschlossen, das Trikot erst am Ende des Schuljahres zu bezahlen und es A auch erst dann zu geben. Damit fehlt es an der gem. § 107 BGB grundsätzlich erforderlichen Einwilligung des gesetzlichen Vertreters (§§ 1626, 1629 Abs. 1 Satz 1 BGB). Die Willenserklärung des A wäre gem. § 108 Abs. 1 BGB schwebend unwirksam. bb) Lediglich rechtlicher Vorteil Die Einigungserklärung des A wäre jedoch auch ohne die Einwilligung seines gesetzlichen Vertreters gem. § 107 BGB wirksam, wenn sie für ihn lediglich rechtlich vorteilhaft wäre. Diese Erklärung führt indessen gem. § 929 Satz 1 BGB dazu, dass A sein Eigentum an den zwei 50 € - Scheinen verliert. Damit ist sie für ihn rechtlich nachteilig. cc) Bewirken der Leistung mit eigenen Mitteln, § 110 BGB Die Einigungserklärung des A könnte ohne die Einwilligung des V auch gem. § 110 BGB wirksam sein, indem er den vollständigen Kaufpreis für das Trikot mit seinen eigenen Ersparnissen bezahlte. Dann müssten ihm die Ersparnisse speziell zu diesem Zweck oder zur freien Verfügung überlassen worden sein. Im vorliegenden Fall hat V jedoch ausdrücklich bestimmt, dass er den Kaufpreis erst nach Schuljahresende begleichen und A das Trikot auch erst zu diesem Zeitpunkt erhalten werde. Damit durfte A seine Ersparnisse nicht zur Bezahlung des Trikots verwenden. Die Voraussetzungen des § 110 BGB sind nicht erfüllt. dd) Gespräche des V mit N und U Eine Genehmigung der Zahlung des A und damit seiner Einigungserklärung i. S. d. § 929 Satz 1 BGB könnte aber darin liegen, dass V von N ein neues Trikot verlangte und außerdem den U darauf hinwies, A habe dem N bereits die 100 € gezahlt. Indem V von N nur ein neues Trikot, nicht aber das Geld zurückverlangt, und indem er sich gegenüber U auf die Wirksamkeit der Zahlung des A an N beruft, genehmigt er die Übereignung der zwei 50 € -Scheine an N gem. §§ 108 Abs. 1, 182, 184, 1626, 1629 Abs. 1 BGB. Gemäß § 184 BGB ist die dingliche Einigung nach § 929 Satz 1 BGB als von Anfang an wirksam anzusehen. ee) Zwischenergebnis A und N haben sich wirksam über den Eigentumsübergang an den zwei 50 € -Scheinen von A auf N gem. § 929 Satz 1 BGB geeinigt. c) Zwischenergebnis A hat N den im Kaufvertrag vereinbarten Kaufpreis für das Trikot i. H. v. 100 € gezahlt und damit die geschuldete Leistung erbracht. 2. Richtiger Gläubiger Diese Leistung müsste A auch an den richtigen Gläubiger bewirkt haben. a) Gläubigerschaft des U A hat die 100 € am Freitag an N gezahlt. Bereits am Mittwoch hatte N die zugrunde liegende Kaufpreisforderung aus § 433 Abs. 2 BGB jedoch gem. § 398 BGB an U abgetreten (siehe oben I. 1.). Somit hat A an den falschen Gläubiger gezahlt. b) Schuldnerschutz des § 407 Abs. 1 BGB Der Anspruch des neuen Gläubigers U wäre aber trotzdem aufgrund der Leistung an den alten Gläubiger N erloschen, wenn die Voraussetzungen der Schuldnerschutzvorschrift des § 407 Abs. 1 BGB vorlägen. Dann hätte A bei der Zahlung an N keine Kenntnis von der Abtretung der Kaufpreisforderung an U haben dürfen. Als A am Freitag dem N die 100 € zahlte, wusste er nichts davon, das N die zugrunde liegende Kaufpreisforderung am Mittwoch an U abgetreten hatte. Somit muss U diese Zahlung des A an N gem. § 407 Abs. 1 BGB gegen sich gelten lassen. 3. Zwischenergebnis Der Anspruch des U gegen A auf Zahlung von 100 € aus §§ 433 Abs. 2, 398 BGB ist nach der Abtretung an U gem. §§ 362 Abs. 1, 407 Abs. 1 BGB durch Erfüllung erloschen, indem A dem N am Freitag die 100 € bezahlte. III. Ergebnis U hat gegen A keinen Anspruch auf Zahlung von 100 € aus §§ 433 Abs. 2, 398 BGB.",
        "difficulty_level": "schwer"
    },
    {
        "case_id": 3,
        "title": "Treuwidrigkeit beim Grundstückskauf",
        "description": "Valentin Vollmer (V) ist Eigentümer eines Hausgrundstücks mit Blick auf den Rhein. Da er dringend Geld benötigt, will er das Grundstück verkaufen, und zwar zu einem möglichst hohen Preis. Deshalb erklärt er der Kau ﬁ nteressentin Katharina Krause (K), die Aussicht auf den Rhein sei unverbaubar. Dabei weiß V genau, dass der einschlägige Bebauungsplan dies gerade nicht vorsieht. K glaubt dem V jedoch und erklärt sich infolgedessen bereit, dem V das Grundstück für 400.000 € abzukaufen. V ist einverstanden. Da V und K Notarkosten und Steuern sparen möchten, verabreden sie, beim 200.000 € als Kaufpreis beurkunden zu lassen. So geschieht es. Notar bloß Einige Tage später meldet sich ein weiterer Kau ﬁ nteressent bei V, der ihm 450.000 € für das Grundstück bietet. Die Umschreibung des Eigentums beim Grundbuchamt ist noch nicht beantragt worden. Muss V den Vertrag mit K erfüllen oder darf er anderweitig über das Grundstück disponieren?",
        "solution": "V muss den Vertrag mit K erfüllen, wenn K gegen ihn einen Anspruch auf Übereignung des Grundstücks aus § 433 Abs. 1 Satz 1 BGB hat. Das setzt einen wirksamen Kaufvertrag über das Grundstück zwischen V und K voraus. I. Kaufvertrag über 200.000 € V und K könnten einen wirksamen Kaufvertrag über 200.000 € geschlossen haben. 1. Vertragsschluss V und K haben einen beurkundeten Kaufvertrag über das Grundstück des V zum Preis von 200.000 € nach Maßgabe der §§ 433, 311b Abs. 1 Satz 1 BGB geschlossen. 2. Wirksamkeit gem. § 117 Abs. 1 BGB Der Wirksamkeit dieses Vertrags könnte allerdings entgegenstehen, dass V und K in Wirklichkeit keinen Preis i. H. v. 200.000 € , sondern i. H. v. 400.000 € wollten. Den beurkundeten Vertrag über 200.000 € haben sie nur zu dem Zweck geschlossen, Notarkosten und Steuern zu sparen. Damit haben sie diesen Vertrag nur zum Schein abgeschlossen, ohne seine Wirksamkeit zu wollen. Gemäß § 117 Abs. 1 BGB ist der über 200.000 € geschlossene Kaufvertrag daher nichtig. II. Kaufvertrag über 400.000 € V und K könnten jedoch einen wirksamen Kaufvertrag über 400.000 € geschlossen haben. 1. Verdecktes Rechtsgeschäft, § 117 Abs. 2 BGB Das setzt zunächst voraus, dass der Kaufvertrag über 400.000 € trotz des beurkundeten Kaufvertrags über 200.000 € , den dieselben Parteien über dasselbe Grundstück abgeschlossen haben, wirksam sein kann. § 117 Abs. 2 BGB stellt diesbezüglich klar, dass der Kaufvertrag über 400.000 € nicht allein deshalb unwirksam ist, weil er durch den notariell beurkundeten Kaufvertrag über 200.000 € verdeckt wird. Vielmehr ﬁ nden nach dieser Vorschrift die für das verdeckte Rechtsgeschäft (das sog. dissimulierte Geschäft) geltenden Vorschriften Anwendung. 2. Inhaltliche Einigung Dann müsste zunächst eine inhaltliche Einigung zwischen V und K vorliegen, dass V der K sein Grundstück für 400.000 € verkaufen und diese es von V kaufen will. Im Gegensatz zu dem beurkundeten Kaufpreis wollten V und K übereinstimmend einen Kaufpreis i. H. v. 400.000 € . Damit liegt eine inhaltliche Einigung vor. 3. Notarielle Beurkundung, § 311b Abs. 1 Satz 1 BGB § 311b Abs. 1 Satz 1 BGB setzt eine notarielle Beurkundung dieses Grundstückskaufvertrags voraus. Beurkundet wurde indessen nur ein Kauf über 200.000 € . Über den Preis von 400.000 € haben sich die Parteien bloß mündlich geeinigt. Somit ist der Kaufvertrag über 400.000 € gem. §§ 117 Abs. 2, 311b Abs. 1 Satz 1, 125 Satz 1 BGB nichtig. III. Ergebnis Es liegt weder ein wirksamer Kaufvertrag über 200.000 € noch über 400.000 € vor. Daher hat K gegen V keinen Anspruch auf Übereignung des Grundstücks aus § 433 Abs. 1 Satz 1 BGB. V muss den Vertrag nicht erfüllen.",
        "difficulty_level": "mittel"
    },
    {
        "case_id": 7,
        "title": "Erpressung und Wirksamkeit eines Kaufvertrags",
        "description": "Die Millionärin Viktoriia (V) aus Tübingen möchte ihre neu errichtete Villa am See mit Kunstgegenständen ausschmücken. Da sie selbst von Kunst nichts versteht, bittet sie den Kunstsachverständigen Siegmund (S), für sie eine Skulptur und ein Bild zu einem Höchstpreis von jeweils 25.000 € zu erwerben. Tags darauf begibt sich S zu dem Kunsthändler Dietmar (D) und erzählt ihm von dem Auftrag, den die V ihm erteilt hat. D zeigt dem S daraufhin die Bronzeskulptur „ Kämpfende Zentauren “ des Bildhauers Franz-Antonio und meint, die Zentauren würden gut in eine feudale Villa passen. Er könne ihm die Skulptur zu einem Preis i. H. v. 20.000 € überlassen. S hält das Werk für völlig misslungen und meint abschätzig, er würde hierfür nicht einmal den Materialwert bezahlen. D erwidert grinsend, zufällig wisse er, dass S vor zwei Jahren eine aus der Lambertikirche gestohlene Madonna gekauft habe. Unter Umständen sei er bereit, auf eine Strafanzeige zu verzichten. S wird bleich und entgegnet, dies sei eine ganz gemeine Erpressung. D erklärt gelassen, es sei sein gutes Recht, eine Straftat zur Anzeige zu bringen. Daraufhin gibt sich S geschlagen und kauft namens der V die Skulptur zu dem geforderten Preis i. H. v. 20.000 € . Als V die „ Kämpfenden Zentauren “ zwei Tage später zu Gesicht bekommt, ist sie entsetzt und macht dem S bittere Vorwürfe. S beichtet der V daher, auf welche Art und Weise der Kauf zu Stande gekommen ist. Sofort ruft V den D an und erklärt ihm, sie fühle sich an den Vertrag nicht gebunden, weil D den S erpresst habe. D besteht auf Zahlung des Kaufpreises. Ist zwischen V und D ein wirksamer Vertrag über den Kauf der Skulptur zu einem Preis i. H. v. 20.000 € zustande gekommen?",
        "solution": "Ein Vertrag i. S. d. § 433 BGB zwischen D und V könnte dadurch zustande gekommen sein, dass D mit S einen Kaufvertrag geschlossen und S die V dabei wirksam vertreten hat (vgl. § 164 Abs. 1 und 3 BGB). I. Einigung zwischen S und D S und D haben sich über den Kauf der Skulptur zu einem Preis i. H. v. 20.000 € geeinigt. Dies ergibt sich eindeutig aus dem Sachverhalt, dem zufolge S die Skulptur zu dem geforderten Preis gekauft hat. II. Wirksame Vertretung des V durch S Ein Kaufvertrag zwischen D und V ist zustande gekommen, wenn S die V bei Abschluss des Vertrags wirksam vertreten hat. Dass die Wirkungen der von und gegenüber einem Vertreter abgegebenen Willenserklärungen den Vertretenen treffen, ergibt sich aus § 164 Abs. 1 (Aktivvertretung) und Abs. 3 (Passivvertretung) BGB. Zu prüfen ist daher, ob die – in § 164 Abs. 1 BGB geregelten – Voraussetzungen einer wirksamen Stellvertretung vorliegen. 1. Eigene Willenserklärung des S S hat eine eigene Willenserklärung abgegeben. 2. Handeln im Namen der V S hat ausdrücklich im Namen der V gehandelt (im Übrigen ist es gem. § 164 Abs. 1 Satz 2 BGB ausreichend, wenn sich das Handeln in fremdem Namen aus den Umständen ergibt). 3. Vertretungsmacht S hat innerhalb der ihm zustehenden Vertretungsmacht gehandelt, die ihm gem. § 167 Abs. 1 Alt. 1 BGB in Form einer Innenvollmacht erteilt worden ist. Insbesondere hat sich S an die Begrenzung des Umfangs der Vollmacht gehalten und die Grenze von 25.000 € nicht überschritten. III. Ergebnis Zwischen D und V ist ein wirksamer Vertrag über den Kauf des Bildes zu einem Preis i. H. v. 20.000 € zustande gekommen.",
        "difficulty_level": "mittel"
    }
]